---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleTappingHole
source: html/5ada6a0c-c3b5-d7dc-cae9-0f06074dbaaa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleTappingHole Property

"Tapping hole"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleTappingHole { get; }
```